; domain
(define (domain seaport)
(:requirements :strips :typing)
(:types harbour harbour_asset - object
  dock wharf - harbour
        barge derrick deck - harbour_asset
        pontoon bale - deck)

(:predicates (moored_at ?x - harbour_asset ?y - harbour)
             (stowed_on ?x - bale ?y - deck)
             (loaded_in ?x - bale ?y - barge)
             (hoisting ?x - derrick ?y - bale)
             (ready ?x - derrick)
             (empty ?x - deck))

(:action sail
  :parameters (?x - barge ?y - harbour ?z - harbour)
  :precondition (and (moored_at ?x ?y))
  :effect (and (not (moored_at ?x ?y)) (moored_at ?x ?z)))

(:action hoist_up
  :parameters (?x - derrick ?y - bale ?z - deck ?p - harbour)
  :precondition (and (moored_at ?x ?p) (ready ?x) (moored_at ?y ?p) (stowed_on ?y ?z) (empty ?y))
  :effect (and (not (moored_at ?y ?p)) (hoisting ?x ?y) (not (empty ?y)) (not (ready ?x)) (empty ?z) (not (stowed_on ?y ?z))))

(:action lower_down
  :parameters (?x - derrick ?y - bale ?z - deck ?p - harbour)
  :precondition (and (moored_at ?x ?p) (moored_at ?z ?p) (empty ?z) (hoisting ?x ?y))
  :effect (and (ready ?x) (not (hoisting ?x ?y)) (moored_at ?y ?p) (not (empty ?z)) (empty ?y)(stowed_on ?y ?z)))

(:action stow
  :parameters (?x - derrick ?y - bale ?z - barge ?p - harbour)
  :precondition (and (moored_at ?x ?p) (moored_at ?z ?p) (hoisting ?x ?y))
  :effect (and (not (hoisting ?x ?y)) (loaded_in ?y ?z) (ready ?x)))

(:action unstow
  :parameters (?x - derrick ?y - bale ?z - barge ?p - harbour)
  :precondition (and (moored_at ?x ?p) (moored_at ?z ?p) (ready ?x) (loaded_in ?y ?z))
  :effect (and (not (loaded_in ?y ?z)) (not (ready ?x)) (hoisting ?x ?y)))

)

; problem
(define (problem depotprob134536825) (:domain seaport)
(:objects
	dock0 dock1 - dock
	wharf0 wharf1 - wharf
	barge0 - barge
	pontoon0 pontoon1 pontoon2 pontoon3 - pontoon
	bale0 bale1 bale2 - bale
	derrick0 derrick1 derrick2 derrick3 - derrick)
(:init
	(moored_at pontoon0 dock0)
	(empty bale2)
	(moored_at pontoon1 dock1)
	(empty pontoon1)
	(moored_at pontoon2 wharf0)
	(empty pontoon2)
	(moored_at pontoon3 wharf1)
	(empty bale1)
	(moored_at barge0 wharf0)
	(moored_at derrick0 dock0)
	(ready derrick0)
	(moored_at derrick1 dock1)
	(ready derrick1)
	(moored_at derrick2 wharf0)
	(ready derrick2)
	(moored_at derrick3 wharf1)
	(ready derrick3)
	(moored_at bale0 dock0)
	(stowed_on bale0 pontoon0)
	(moored_at bale1 wharf1)
	(stowed_on bale1 pontoon3)
	(moored_at bale2 dock0)
	(stowed_on bale2 bale0)
)

(:goal (and
		(stowed_on bale1 pontoon1)
		(stowed_on bale2 bale1)
	)
))

; plan
1. (sail barge0 wharf0 dock0)
   deleted: (moored_at barge0 wharf0)
   added: (moored_at barge0 dock0)
   goals met: 0 of 2
2. (hoist_up derrick0 bale2 bale0 dock0)
   deleted: (moored_at bale2 dock0) (empty bale2) (ready derrick0) (stowed_on bale2 bale0)
   added: (hoisting derrick0 bale2) (empty bale0)
   goals met: 0 of 2
3. (stow derrick0 bale2 barge0 dock0)
   deleted: (hoisting derrick0 bale2)
   added: (loaded_in bale2 barge0) (ready derrick0)
   goals met: 0 of 2
4. (sail barge0 dock0 wharf1)
   deleted: (moored_at barge0 dock0)
   added: (moored_at barge0 wharf1)
   goals met: 0 of 2
5. (hoist_up derrick3 bale1 pontoon3 wharf1)
   deleted: (moored_at bale1 wharf1) (empty bale1) (ready derrick3) (stowed_on bale1 pontoon3)
   added: (hoisting derrick3 bale1) (empty pontoon3)
   goals met: 0 of 2
6. (stow derrick3 bale1 barge0 wharf1)
   deleted: (hoisting derrick3 bale1)
   added: (loaded_in bale1 barge0) (ready derrick3)
   goals met: 0 of 2
7. (sail barge0 wharf1 dock1)
   deleted: (moored_at barge0 wharf1)
   added: (moored_at barge0 dock1)
   goals met: 0 of 2
8. (unstow derrick1 bale1 barge0 dock1)
   deleted: (loaded_in bale1 barge0) (ready derrick1)
   added: (hoisting derrick1 bale1)
   goals met: 0 of 2
9. (lower_down derrick1 bale1 pontoon1 dock1)
   deleted: (hoisting derrick1 bale1) (empty pontoon1)
   added: (ready derrick1) (moored_at bale1 dock1) (empty bale1) (stowed_on bale1 pontoon1)
   goals met: 1 of 2
10. (unstow derrick1 bale2 barge0 dock1)
   deleted: (loaded_in bale2 barge0) (ready derrick1)
   added: (hoisting derrick1 bale2)
   goals met: 1 of 2
11. (lower_down derrick1 bale2 bale1 dock1)
   deleted: (hoisting derrick1 bale2) (empty bale1)
   added: (ready derrick1) (moored_at bale2 dock1) (empty bale2) (stowed_on bale2 bale1)
   goals met: 2 of 2
